[
    {
        "day": "Day 1",
        "date": "April 27",
        "tracks": [
            {
                "hour": "8:45 AM",
                "title": "🎟 Registration"
            },
            {
                "hour": "9:30 AM",
                "title": "Opening remarks"
            },
            {
                "hour": "9:50 AM",
                "title": "Nobody Knows What Time It Is",
                "speaker": "Vaidehi Joshi",
                "business": "Tilde",
                "abstract": "Someone once said that time is a flat circle, which is all well and good...but how on earth does anyone know what time it actually is? In this talk, we’ll try to understand why time is such a hard problem in distributed systems, some of the ways that people have tried to solve this problem, and how one computer scientist's solution completely changed the trajectory of the internet forever.",
                "twitter": "vaidehijoshi"
            },
            {
                "hour": "10:25 AM",
                "title": "An Uncoordinated Approach To Scaling (Almost) Infinitely",
                "speaker": "Andrew Turley",
                "business": "Wallaroo Labs",
                "abstract": "Scaling distributed applications becomes difficult because of the overhead of coordinating state across workers. But what if we designed systems to avoid coordination in the first place? This talk covers how to do this and what properties we could expect from such a system.",
                "twitter": "casio_juarez"
            },
            {
                "hour": "11:00 AM",
                "title": "☕🥐 Coffee / Snack Break"
            },
            {
                "hour": "11:25 AM",
                "title": "Learning AI with Van Gogh, Botero and Cruz-Diez",
                "speaker": "Raul Pino",
                "business": "uBiome",
                "abstract": "Every time somebody mention AI news in the office, you wonder on the glorious future beyond your daily data taming or pipelines monitoring. In this talk you will be introduced to Neural Networks applied to arts, using a paper \"A Neural Algorithm of Artistic Style\" as a \"deep\" start.",
                "twitter": "p1nox"
            },
            {
                "hour": "12:00 PM",
                "title": "Building an HPC infrastructure at a Liberal Arts College",
                "speaker": "Asya Shklyar",
                "business": "Pomona College",
                "abstract": "This talk aims to describe the process of design, prototyping, and building the HPC infrastructure at Pomona College in Claremont, CA, employing the best practices in building HPC, hybrid, and cloud infrastructure and adjusting to the unique needs of a higher ed environment.",
                "twitter": "hedgehogy"
            },
            {
                "hour": "12:35 PM",
                "title": "Ice Breaker"
            },
            {
                "hour": "12:55 PM",
                "title": "Lunch"
            },
            {
                "hour": "2:15 PM",
                "title": "Don't Get Distracted",
                "speaker": "Caleb Thompson",
                "business": "Heroku",
                "abstract": "I worked on a WiFi geolocation app for a DoD contractor. When I realized its use was to track down and kill people, I was faced with a moral dilemma. I'll share the technical details of the app that made it so interesting to me & discuss the ethics of building tools without understanding their use.",
                "twitter": "calebthompson"
            },
            {
                "hour": "2:50 PM",
                "title": "CD en CloudFront con CircleCI y Workflows",
                "speaker": "Maria Camila Gomez Restrepo",
                "business": "Experimentality SAS",
                "abstract": "Desplegar el front-end en CloudFront (AWS) puede llegar a ser un dolor de cabeza si no se sabe cuales son los paso a seguir, además de se un proceso tedioso para agregar el más mínimo cambio. Por ello esta charla espera entregar algunos trucos que me has facilitado la vida en los últimos meses.",
                "twitter": "camigomez318"
            },
            {
                "hour": "3:05 PM",
                "title": "Attacking yourself is healthy",
                "speaker": "Julián Forero",
                "business": "Endava",
                "abstract": "Information Security is one of the most important concerns about these days. Several issues and vulnerabilities are discovered everyday, affecting a lot of industries, leaking information which could be secured with a simple update. In this talk, we are going to explain why security testing can be done based on simple tools like browser debugging, TLS, browser developer tools, correct management of cookies, among others. As a result, you will realize how exposed you are and how to protect your web app in a live environment.",
                "twitter": "scaleconfco#"
            
            },
            {
                "hour": "3:20 PM",
                "title": "☕🥐 Coffee / Snack Break"
            },
            {
                "hour": "3:40 PM",
                "title": "",
                "speaker": "Little engineers",
                "business": "FMO",
                "abstract": ""
            },
            {
                "hour": "3:55 PM",
                "title": "Reactive Microservices",
                "speaker": "Didier Tabares",
                "business": "PSL",
                "abstract": "Within a microservices architecture, what does it take to build a highly responsive system, vastly improve the user experience and ensure fail resilience? By applying reactive principles and patterns, of course. Learn how to respond to the needs of today while anticipating the demands of tomorrow.",
                "twitter": "dialtahi"
            },
            {
                "hour": "4:30 PM",
                "title": "Functional Programming & NoSQL Design",
                "speaker": "David Greenberg",
                "business": "Amazon Advertising",
                "abstract": "Over the past several years, NoSQL databases are seen everywhere, because they are scalable and easy to set up and operate. Multi-database systems have also become common: relational databases can handle joins that NoSQL databases cannot, and legacy databases stay around because migrations are expensive. Over the same time period, software developers have come to identify immutability as a simplifying tool that helps the creation of concurrent and distributed systems. In this talk, we'll learn about immutability, a concept from functional programming. By learning about structural sharing, immutable views, and simplified diagnostic debugging, we'll see how we can leverage this concept in order to improve the performance and effectiveness of NoSQL data models and schema design.",
                "twitter": "dgrnbrg"
            },
            {
                "hour": "5:05 PM",
                "title": "Operaciones Matriciales a Gran Escala",
                "speaker": "Elizabeth Ramirez",
                "business": "Descartes Labs",
                "abstract": "Las estructuras matriciales (o tensoriales)  son fundamentales en un gran número de aplicaciones en Computación Científica y Machine Learning, donde los datos son representados de manera n-dimensional, inducidos por la discretización de funciones multivariable y/o mediciones de multiples propiedades de un sistema observado. En Deep Learning, por ejemplo, en cada capa de una red neuronal se realizan transformaciones sobre dichas estructuras para encontrar mejores representaciones. Sin embargo, las estructuras matriciales sufren del llamado “curse of dimensionality”, lo cual resalta la importancia de contar con algoritmos altamente eficientes para ejecutar operaciones comunes, como solución de sistemas lineales, problemas de eigenvalues y optimización. Esta presentación estará enfocada desde el punto de vista de computación numérica en los métodos usados para la representación óptima de estructuras matriciales, así como librerías y hardware diseñados para ejecutar operaciones matriciales a gran escala.",
                "twitter": "eramirem"
            },
            {
                "hour": "5:40 PM",
                "title": "Closing remarks"
            },
            {
                "hour": "5:50 PM",
                "title": "👋 End"
            },
            {
                "hour": "6:00 PM",
                "title": "🚌 Bus leaves to hotel"
            }
        ]
    },
    {
        "day": "Day 2",
        "date": "April 28",
        "tracks": [
            {
                "hour": "9:00 AM",
                "title": "🎟 Registration"
            },
            {
                "hour": "9:30 AM",
                "title": "Opening remarks"
            },
            {
                "hour": "9:50 AM",
                "title": "What We Talk About When We Talk About Disk IO",
                "speaker": "Alex Petrov",
                "business": "Datastax",
                "abstract": "In the world of Big Data, it’s important to know how the Database Storage works in order to be able to pick a right tool right job. The talk covers evaluation techniques, to choose storage with best read, write or memory overhead, best suitable for your data.",
                "twitter": "ifesdjeen"
            },
            {
                "hour": "10:25 AM",
                "title": "Metaphors We Compute By",
                "speaker": "Alvaro Videla",
                "business": "Former Core Dev @ RabbitMQ",
                "abstract": "We think in words, we talk with words, we understand the world thanks to words. Metaphors take words to the next level explaining concepts that were escaping our understanding before. In 1980 George Lakoff revolutionised the linguistic and philosophic worlds when he studied how metaphors affect our thinking, how they influence our actions and even shape who we are. What happens with the metaphors that we use in the software Industry? In this talk we are going to review the importance that metaphors have in our code quality, in the algorithms we choose, and the products we ship. As a practical example, we are going to see why Microservices and Containers have been so successful in the past couple of years. We'll try to understand why they have redefined how we package and ship products in our industry today.",
                "twitter": "old_sound"
            },
            {
                "hour": "11:00 AM",
                "title": "☕🥐 Coffee / Snack Break"
            },
            {
                "hour": "11:25 AM",
                "title": "Zero Downtime Migrations at Scale",
                "speaker": "Aysylu Greenberg",
                "business": "Google",
                "abstract": "Already have a system that serves user traffic and it has become so popular that it's hitting scaling limitations? It's probably time to upgrade its architecture or move its data to a more scalable database. Learn how to do this upgrade with zero downtime and no user visible effects in my talk!",
                "twitter": "aysylu22"
            },
            {
                "hour": "12:00 PM",
                "title": "Modern Security with Microservices and the Cloud",
                "speaker": "Seth Vargo",
                "business": "Google Cloud",
                "abstract": "It’s great that you’ve moved to microservices, but how are you distributing secrets? This talk offers an overview of Vault’s unique approach to secret management by providing secrets as a service for services (and humans), that is highly scalable and easily customizable to fit any environment.",
                "twitter": "sethvargo"
            },
            {
                "hour": "12:35 PM",
                "title": "📷 Conference Photo"
            },
            {
                "hour": "12:55 PM",
                "title": "Lunch"
            },
            {
                "hour": "2:15 PM",
                "title": "The overnight failure",
                "speaker": "Sebastian Sogamoso",
                "business": "Cookpad",
                "abstract": "This talk is based on a true story. Imagine the worst thing that could happen to you at work. For me, that was charging users thousands of times the amount they should have been charged and it happened. Did someone get fired? Did the company survive? Come to the talk and find out.",
                "twitter": "sebasoga"
            },
            {
                "hour": "2:50 PM",
                "title": "An Introduction to Smart Contracts",
                "speaker": "Miguel Palhas",
                "business": "Subvisual",
                "abstract": "Let's talk blockchain! But not the whole money thing. Smart Contracts are the real juice. I will walk you through what a Smart Contract is and why you should care. We will discuss how they differ from traditional computing methods, and what makes this so revolutionary.",
                "twitter": "naps62"
            },
            {
                "hour": "3:25 PM",
                "title": "Kubernetes: An intro to the magic of containers orchestration",
                "speaker": "Catherin Cruz",
                "business": "Endava",
                "abstract": "Have you tried to figure out what is Kubernetes and how it works? Yes, it’s a bit challenging and sometimes just plain magic. What about starting from knowing the power of its components, its deploys spells, and then get the wizard best practices. Here is an intro to the magical world of Kubernetes!",
                "twitter": "UserTwoGG"
            },
            {
                "hour": "4:00 PM",
                "title": "☕🥐 Coffee / Snack Break"
            },
            {
                "hour": "4:20 PM",
                "title": "Patterns for building Highly Available Cluster Schedulers",
                "speaker": "Diptanu Choudhury",
                "business": "Facebook",
                "abstract": "Schedulers are at the core of modern infrastructure and offer various foundational services on top of which applications using SOA principles are built. In this talks, we would go over some of the most important papers in the last decade and discuss how to build scalable schedulers for elastic infrastructure. We would also discuss how those principles are applied to open source schedulers like Nomad, Mesos or Kubernetes.",
                "twitter": "diptanu"
            },
            {
                "hour": "4:55 PM",
                "title": "The Math behind Distributed Systems",
                "speaker": "Veronica Lopez",
                "business": "CoreOS",
                "abstract": "Formal verification of distributed systems is hard and expensive. Instead of dealing with it, modern distributed systems rely on tools like observability, extensive testing, and more recently, chaos engineering. Understanding the math behind distributed computing, and being able to express systems in terms of algebraic topology and graph theory brings a new possibility of formal verification and a new approach towards solving complex problems and their interconnections.",
                "twitter": "maria_fibonacci"
            },
            {
                "hour": "5:30 PM",
                "title": "Closing remarks"
            },
            {
                "hour": "5:40 PM",
                "title": "👋 End"
            },
            {
                "hour": "5:50 PM",
                "title": "🚌 Bus leaves to closing event / hotel"
            },
            {
                "hour": "6:20 PM",
                "title": "🎉 Closing Event",
                "abstract": "(Free transportation provided outside of venue to closing event)"
            }
        ]
    }
]
